// Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
 int a = 10, b = 81;

 if (a == b / a)
 {
    Console.WriteLine("yes, it is");
 }
else
{
    Console.WriteLine("no, it isn't");
}
